name: "preprocessing"
backend: "python"

input [
    {
        name: "image"
        data_type: TYPE_FP32
        dims: [1, -1, -1, 3]
    }
]

output [
    {
        name: "input_image"
        data_type: TYPE_FP32
        dims: [1, 512, 512, 3]
    }
]
